name = "七仔的桌面工具"

service_agreement = """
<article class="markdown-body">
          <h1>七仔的桌面工具 用户协议</h1>
<p>1.导言</p>
<p>1.1 欢迎您使用七仔（七仔的桌面工具）产品及相关服务！</p>
<p>七仔（七仔的桌面工具）产品及相关服务（下称“本产品及相关服务”），系指****信息科技有限公司及其关联方（以下简称“我方”）合法拥有并运营的、标注名称为“七仔（七仔的桌面工具）”的客户端应用程序及相关服务。《用户协议》（以下称“本协议”）是您与我方就您使用本产品及相关服务所订立的协议。</p>
<p>1.2 为了更好地为您提供服务，请您在开始使用本产品及相关服务之前，认真阅读并充分理解本协议，特别是<u><strong>涉及免除或者限制责任的条款、权利许可和信息使用的条款、法律适用和争议解决条款</strong></u>等。其中，免除或者限制责任条款等重要内容将以**<u>加粗、下划线</u>**等形式提示您注意，您应重点阅读。</p>
<p>1.3 如您未成年，您以及您的法定监护人都应该仔细阅读、充分理解并同意本协议。</p>
<p>1.4 如果您不同意本协议中的条款，请您不要使用本产品及相关服务。如您自主选择使用本产品及相关服务，则视为您已充分理解本协议，并同意作为本协议的一方当事人接受本协议以及其他与本产品及相关服务有关的协议和规则（包括但不限于《隐私政策》）的约束。</p>
<p>1.5 我方有权依本产品及相关服务运营的需要单方决定，安排或指定关联方、控制公司、继承公司或公司认可的第三方公司继续运营本产品及相关服务。并且，就本协议项下涉及的某些服务，可能会由公司的关联方、控制公司、继承公司或公司认可的第三方公司向您提供，如果您接受相关服务内容，您应该接受相关权利义务关系亦受本协议约束。</p>
<p><strong><u>1.6 您在使⽤本产品及相关服务时，还涉及使用非我方（其他第三方）提供的产品或服务的，您除遵守本协议约定外，还应遵守其他第三⽅的⽤户协议及相关法律文本。我方和其他第三⽅对可能出现的纠纷在法律规定和约定的范围内各⾃承担责任。</u></strong></p>
<p>1.7 如对本协议内容有任何疑问、意见或建议，请您及时通过我方提供的官方联系方式与我方取得联系。</p>
<p>2. 本产品及相关服务</p>
<p><strong>2.1本产品及相关服务旨在为⽤户提供⼀个插件运行环境，您可以通过我方官方及官方授权的渠道获取本产品并接受相关服务，并通过包括但不限于自主开发、获取、选择安装等⽅式，⾃由选配丰富的插件，打造您得⼼应⼿的⼯具集合，您还可以自主选择接受我方提供的其他相关服务。若您并非通过我方官方授权的渠道获取本产品及相关服务，我方无法保证非官方版本能够正常使用。</strong></p>
<p>2.2 我方可能为不同的终端设备开发不同的版本，您应当根据实际设备状况获取、下载、安装合适的版本。</p>
<p>2.3 您可根据需要自行使用本产品及相关服务或更新版本，如您不再需要使用本产品及相关服务，您可以自行卸载本软件，如果您愿意帮助我方改进产品服务，请告知我方您卸载的原因，我方在此表示感谢。</p>
<p><strong><u>2.4 更新及完善</u></strong></p>
<p>2.4.1 为更好的提升用户体验及服务，我方将不定期提供本产品及相关服务的更新或改变（包括但不限于针对本产品即相关服务进行修改、升级、功能强化、开发新服务、替换现有内容等）。</p>
<p>2.4.2 为保证本产品及相关服务安全、提升用户服务，本产品及相关服务部分或全部更新后，我方将在可行情况下以适当方式（包括但不限于系统提示、网站公告等）提示您。</p>
<p><u><strong>2.4.3 本产品及相关服务更新版本发布后，旧版本可能⽆法使⽤。请您理解，我方不保证旧版本继续可⽤（包括相应的客户服务）。</strong></u></p>
<p><strong><u>2.4.4  本产品及相关服务更新或改变发生后，您仅应在接受了我方做出的调整后，继续使用本产品及相关服务。我方可以因业务发展需要，对部分功能效果进行改变或进行限制，给您造成的不便，请您理解。</u></strong></p>
<p>2.5 除非得到我方事先书面授权，您不应以任何形式对本产品及相关服务进行包括但不限于复制（您仅可以为个人使⽤本产品即相关服务的⽬的，制作本产品及相关服务的副本）、改编、传播、镜像、交易以及将本产品及相关服务作为为其他人提供商业服务的工具等未经授权的访问或使用。</p>
<p><strong><u>2.6 我方许可您一项个人的、可撤销的、不可转让的、非独占地的合法使用本产品及相关服务的权利，您不享有本产品的所有权。您仅可以依据个人生活、办公、娱乐需要使用本产品及相关服务。同时我方如未行使前述任何权利，并不构成对该权利的放弃。授权的有效性依赖于如下条件：</u></strong></p>
<p><strong>（1） <u>本产品的使用未违反本协议及本产品上的各项规则。</u></strong></p>
<p><strong>（2） <u>您取得了必要的授权和资格以使用本产品及相关服务。</u></strong></p>
<p><strong>（3） <u>本协议被全部接受，且没有被违反。</u></strong></p>
<p><strong>（4） <u>您未通过任何方式侵犯我方的知识产权或其他合法权利。</u></strong></p>
<p>3. 关于“帐号”</p>
<p>3.1 账号指的是您用以登录并以注册用户身份使用本产品及相关服务的电子身份凭证。</p>
<p><strong>3.2 帐号注销</strong></p>
<p><strong>在需要终止使用帐号服务时，符合以下条件的，您可以申请注销您的帐号：</strong></p>
<p><strong>（1）您仅能申请注销您本人的帐号，并依照我方的流程进行注销；</strong></p>
<p><strong>（2）您仍应对您在注销帐号前使用本产品及相关服务的行为承担相应责任；</strong></p>
<p><strong>（3）注销成功后，帐号记录、功能等将无法恢复或提供；</strong></p>
<p><strong>（4）对于您的账号中尚存的全部权益（包括会员权益、余额等），您选择主动放弃，且不要求我方提供任何形式的补偿或赔偿。</strong></p>
<p><strong>如您需要注销您的帐号，你可以通过官方渠道与我司取得联系要求注销您的账号，我方会在收到您的请求后<u>十五个工作日</u>内，完成注销或与您协商以确认账号注销事宜。</strong></p>
<p>3.3 您理解并承诺，您所设置的帐号不得违反国家法律、法规及的相关规则，您的帐号名称等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、头像等或采取其他足以让人引起混淆的方式）开设帐号，不得恶意注册帐号（包括但不限于频繁注册、批量注册帐号等行为）。您在帐号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。我方有权对您提交的注册信息进行审核，但我方的审核行为不为我方设立任何义务。</p>
<p><strong><u>3.4 您注册的帐号仅限于您本人使用，未经我方书面同意，禁止以任何形式赠与、出借、出租、转让、售卖或以其他方式许可他人使用该帐号。如果我方发现或者有合理理由认为使用者并非帐号初始注册人，为保障帐号安全，我方有权立即暂停或终止向该注册帐号提供服务，并有权永久禁用该帐号。</u></strong></p>
<p>3.5 您有责任维护个人帐号、密码的安全性与保密性，并对您以注册帐号名义所从事的活动承担全部法律责任，包括但不限于您在本产品及相关服务上进行的任何数据修改、言论发表、款项支付等操作行为可能引起的一切法律责任。您应高度重视对帐号与密码的保密，在任何情况下不向他人透露帐号及密码。若发现他人未经许可使用您的帐号或发生其他任何安全漏洞问题时，您应当立即通知我方进行处理。</p>
<p>3.6 如您遗忘了账号信息或因为其他情况导致无法通过账号登录，可以通过产品及相关页面的引导或联系我方官方请求找回账号信息。<strong><u>您理解并认可，账号找回机制仅识别申请找回人提供的信息与后台信息是否一致，而无法保证申请人是否系帐号真正有权使用者。我方特别提醒您应妥善保管您的账号信息。当您使用完毕后，应退出。因您保管不当等自身原因或其他不可抗因素导致遭受盗号或密码丢失，您应自行承担相应责任。</u></strong></p>
<p>3.7 在注册、使用和管理帐号时，您应保证注册帐号时填写的信息的真实性，若您提交的材料或提供的信息不准确、不真实、不规范、不合法或者我方有理由怀疑为错误、不实或不合法的资料，则我方有权拒绝为您提供相关服务，您可能无法使用本产品及相关服务或在使用过程中部分功能受到限制。</p>
<p>3.8 当您完成的帐号注册、登录并进行合理和必要的验证后，您可以向我方要求查询、修正自己提交的个人信息。您理解并同意，出于安全性和身份识别（如帐号信息或密码找回服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。您也可以申请注销帐号，我方会在完成身份、安全状态、设备信息、侵权投诉等方面的合理和必要的验证后协助您注销帐号，并依照您的要求删除有关您帐号的一切信息，法律法规另有规定的除外。</p>
<p>4. 用户个人信息保护</p>
<p>我方与您一同致力于您个人信息（即能够独立或与其他信息结合后识别您身份的信息）的保护。保护用户个人信息是我方的基本原则之一，在使用本产品及相关服务的过程中，您可能会需要提供您的个人信息，以便我方向您提供更好的服务和相应的技术支持。我方将依法保护您浏览、修正、删除相关个人信息以及撤回授权的权利，并将运用加密技术、匿名化处理等其他与本产品及相关服务相匹配的技术措施及其他安全措施保护您的个人信息。更多关于您个人信息保护的内容，请参看《隐私政策》，本协议与《隐私政策》有不符的，以《隐私政策》内容为准。</p>
<p>5. 用户行为规范</p>
<p>5.1 用户行为要求</p>
<p>您应对您使用本产品及相关服务的行为负责，除非法律允许或者经我方事先书面许可，您使用本产品及相关服务不得具有下列行为：</p>
<p>5.1.1 使用未经我方授权或许可的任何插件、外挂、系统或第三方工具对本产品及相关服务的正常运行进行干扰、破坏、修改或施加其他影响。</p>
<p><strong>5.1.2 利用或针对本产品及相关服务进行任何危害计算机网络安全的行为，包括但不限于：</strong></p>
<p><strong>（1）非法侵入网络、干扰网络正常功能、窃取网络数据等危害网络安全的活动；</strong></p>
<p><strong>（2）提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；</strong></p>
<p><strong>（3）明知他人从事危害网络安全的活动的，为其提供技术支持等帮助；</strong></p>
<p><strong>（4）使用未经许可的数据或进入未经许可的服务器/帐号；</strong></p>
<p><strong>（5）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；</strong></p>
<p><strong>（6）未经许可，企图探查、扫描、测试系统或网络的弱点或其它实施破坏网络安全的行为；</strong></p>
<p><strong>（7）企图干涉、破坏系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；</strong></p>
<p><strong>（8）对本产品及相关服务进行反向工程、反向汇编、编译或者以其他方式尝试发现本产品及相关服务的源代码；</strong></p>
<p><strong>（9）违反法律法规、本协议、我方的相关规则及侵犯他人合法权益的其他行为</strong>。</p>
<p>5.1.3 如果我方有理由认为您的行为违反或可能违反上述约定的，我方可独立进行判断并处理，且在任何时候有权在不事先通知的情况下终止向您提供服务，并依法追究相关责任。请注意，这不代表我方保证能够及时处理您或其他用户所有的违约行为，也不为我方设立任何义务。</p>
<p>5.2 信息内容展示及规范</p>
<p><strong><u>您制作、评论、发布、传播的信息应自觉遵守法律法规，保证该等信息不侵害国家、社会或其他任何第三人的合法权益，并保证其真实性，否则我方有权立即采取相应处理措施。您同意并承诺不制作、复制、发布、传播下列信息：</u></strong></p>
<p><strong>（1）反对宪法确定的基本原则的；</strong></p>
<p><strong>（2）危害国家安全，泄露国家秘密的；</strong></p>
<p><strong>（3）颠覆国家政权，推翻社会主义制度，煽动分裂国家，破坏国家统一的；</strong></p>
<p><strong>（4）损害国家荣誉和利益的；</strong></p>
<p><strong>（5）宣扬恐怖主义、极端主义的；</strong></p>
<p><strong>（6）宣扬民族仇恨、民族歧视，破坏民族团结的；</strong></p>
<p><strong>（7）煽动地域歧视、地域仇恨的；</strong></p>
<p><strong>（8）破坏国家宗教政策，宣扬邪教和封建迷信的；</strong></p>
<p><strong>（9）编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；</strong></p>
<p><strong>（10）散布、传播淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</strong></p>
<p><strong>（11）危害网络安全、利用网络从事危害国家安全、荣誉和利益的；</strong></p>
<p><strong>（12）侮辱或者诽谤他人，侵害他人合法权益的；</strong></p>
<p><strong>（13）涉及他人隐私、个人信息或资料的；</strong></p>
<p><strong>（14）散布污言秽语，损害社会公序良俗的；</strong></p>
<p><strong>（15）侵犯他人隐私权、名誉权、肖像权、知识产权等合法权益内容的；</strong></p>
<p><strong>（16）散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息；</strong></p>
<p><strong>（17）其他含有违反法律法规、政策及公序良俗、干扰正常运营或侵犯其他用户或第三方合法权益内容的信息。</strong></p>
<p>5.3 您可以通过我方的官方联系方式向我方投诉、举报各类违法违规行为、违法传播活动、违法有害信息等内容，我方将及时受理和处理您的投诉举报。</p>
<p><strong><u>5.4 插件的开发、共享</u></strong></p>
<p><u><strong>5.4.1 我方提供了部分关于本产品即相关服务的技术文档，我方允许您利用该等文档⾃⾏开发插件，您可以自行使用对应插件也可以再授权他人使用。您可以借助我方产品及相关服务来展示、交流您的开发思路，也可以将插件文件提供给其他第三方（一般指其他用户）使用。如果您借助我方产品及相关服务进行了上述行为，视为您已经向我方提供了足够的授权以完成上述目的。</strong></u></p>
<p><u><strong>5.4.2 为了保护网络环境，我方有权针对您通过我方产品及相关服务发布的内容、提供的各项插件文件进行审核，并有权拒绝针对您发布的内容以及您提供的各项插件文件提供相关的信息展示、传输等服务，但请理解，我方的审核工作并不为我方设立任何的义务。您发布的内容、提供的插件应符合相关法律法规规定、不侵犯他人知识产权及其他合法权益、不违背相关政策及公序良俗，由您提供的插件引发的任何争议及损害，我方不承担任何责任。如果由于您提供的插件给我方造成损失的，您应该承担相应的损害赔偿责任。</strong></u></p>
<p>6. 信息内容使用规范</p>
<p><strong>未经我方书面许可，任何用户、第三方均不得自行或授权、允许、协助他人对本产品及相关服务中信息内容进行如下行为：</strong></p>
<p><strong>（1）复制、读取、采用本产品及相关服务的信息内容，用于商业用途；</strong></p>
<p><strong>（2）擅自编辑、整理、编排本产品及相关服务的信息内容后在本产品及相关服务的页面以外的渠道进行展示；</strong></p>
<p>（3）自行或协助第三人对本产品及相关服务的信息内容产生流量、阅读量引导、转移、劫持等不利影响；</p>
<p>（4）其他非法获取或使用本产品及相关服务的信息内容的行为。</p>
<p>7. 违约处理</p>
<p><strong><u>7.1 针对您违反本协议或其他服务条款的行为，我方有权独立判断并视情况采取预先警示、删除内容、限制帐号部分或者全部功能直至终止提供服务、永久关闭帐号等措施，对于因此而造成您无法正常使用帐号及相关服务、无法正常获取您帐号内资产或其他权益等后果，我方不承担任何责任。我方有权公告处理结果，且有权根据实际情况决定是否恢复相关帐号的使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为，我方将保存有关记录，并有权依法向有关主管部门报告、配合有关主管部门调查、向公安机关报案等。对已删除内容我方有权不予恢复。</u></strong></p>
<p>7.2 因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行处理并承担可能因此产生的全部法律责任。因您的违法或违约等行为导致我方及其关联方、控制公司、继承公司向任何第三方赔偿或遭受国家机关处罚的，您还应足额赔偿我方及其关联方、控制公司、继承公司因此遭受的全部损失。</p>
<p>7.3 我方尊重并保护用户及他人的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用本产品及相关服务时上传的文字、图片、视频、音频、链接、文件等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，我方有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行处理并承担可能因此产生的全部法律责任；如因您的侵权行为导致我方及其关联方、控制公司、继承公司遭受损失的（包括但不限于经济、商誉等损失），您还应足额赔偿我方及其关联方、控制公司、继承公司遭受的全部损失。</p>
<p>8. 服务的变更、中断和终止</p>
<p>8.1 您理解并同意，我方提供的本产品及相关服务是按照现有技术和条件所能达到的现状提供的。我方会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，我方不能随时或始终预见和防范法律、技术以及其他风险，包括但不限于不可抗力、网络原因、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、不能正常使用本产品及相关服务以及其他的损失和风险。</p>
<p>8.2 您理解并同意，我方为了整体服务运营、平台运营安全的需要，有权视具体情况决定服务/功能的设置及其范围修改、中断、中止或终止本产品及相关服务。</p>
<p>9. 广告</p>
<p>9.1 您理解并同意，我方可能会在产品及相关服务页面向您展示、推送具有相关性的信息、广告发布或品牌推广信息等，包括向您展示第三方的商业广告（包括但不限于资讯、移动应⽤、第三⽅服务的链接）。对于第三方商业广告的真实性、有效性，我司无法提供保证，请你自行确认，并审慎理解该等广告信息。</p>
<p><strong><u>9.2 我司还有可能通过电子邮件、手机短信等方式向您发送商业广告，您可以选择拒绝接受该等广告，如果您选择拒绝，我方将不再通过对应的渠道向您提供该等商业广告。</u></strong></p>
<p>10. 知识产权</p>
<p>10.1 我方在本产品及相关服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于我方及其实际权利人所有。我方提供及相关服务时所依托的软件的著作权、专利权及其他知识产权均归我方及其实际权利人所有。未经我方及其实际权利人许可，任何人不得擅自使用（包括但不限于通过任何机器人、“蜘蛛”等程序或设备监视、复制、传播、展示、镜像、上载、下载）本产品及相关服务中的内容。</p>
<p><strong><u>10.2 您不得删除本产品及相关服务上的任何权利标识。</u></strong></p>
<p><strong><u>10.3 您不得在未经过授权的情况下对于本本产品及相关服务中包含的任何权利标识进行任何明示或暗示地使用。</u></strong></p>
<p><strong><u>10.4 您理解并承诺，您在使用本产品及相关服务时发布、提供、上传的内容（包括但不限于文字、图片、音频、文件等各种形式的内容及其中包含所有组成部分）均由您原创或已获合法授权（且含转授权）。您通过上传、发布所产生内容的知识产权归属您或原始著作权人所有，但您应授权我方基于您选择的功能或服务，针对您上传的内容进行使用。</u></strong></p>
<p>11. 免责声明</p>
<p><strong><u>11.1 您理解并同意，本产品及相关服务可能会受多种因素的影响或干扰，我方不保证(包括但不限于)：</u></strong></p>
<p><u><strong>（1）本产品及相关服务完全适合用户的使用要求；</strong></u></p>
<p><u><strong>（2）本产品及相关服务不受干扰，及时、安全、可靠或不出现错误；用户经由我方取得的任何软件、服务或其他材料符合用户的期望；</strong></u></p>
<p><u><strong>（3）本产品及相关服务中任何错误都将能得到更正。</strong></u></p>
<p><strong><u>11.2 针对您在使用我方产品及相关服务过程中所接触到的信息，请您谨慎对待并自行判断其真实性，对于您基于我方产品及相关服务上的信息所执行的行为给您造成的损失，您应自行承担相应的责任。</u></strong></p>
<p><strong><u>11.3 因您使⽤本软件或要求我方提供特定服务时，我方可能会调⽤第三⽅系统或者通过第三⽅⽀持您的使⽤或访问，使⽤或访问的结果由该第三⽅提供，我方不保证通过第三⽅系统提供的服务及内容或⽀持实现的结果的安全性、准确性、有效性及不存在其他不确定的⻛险，由此若引发的任何争议及损害，与我方⽆关，我方不承担任何责任。</u></strong></p>
<p>11.4 您理解并同意，在使用本产品及相关服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见、不能克服并不能避免的客观事件），包括但不限于政府行为、自然灾害（如洪水、地震、台风等）、网络原因、战争、罢工、骚乱等。出现不可抗力情况时，我方将努力在第一时间及时修复，但因不可抗力造成的暂停、中止、终止服务或造成的任何损失，我方在法律法规允许范围内免于承担责任。</p>
<p>11.5 我方依据本协议约定获得处理违法违规内容的权利，该权利不构成我方的义务或承诺，我方不能保证及时发现违法行为或进行相应处理。</p>
<p><strong><u>11.6 您理解并同意：我方仅以产品及相关服务当前的实际使用效果向你提供保证，关于本产品及相关服务，我方不提供任何种类的明示或暗示担保或条件，包括但不限于对于本产品及相关服务的有效性、使用效果等进行保证。您对本产品及相关服务的使用行为应自行承担相应风险。</u></strong></p>
<p>11.7 在任何情况下，我方均不对您使用本产品及相关服务而遭受的利润损失承担责任。除法律法规另有明确规定外，我方对您承担的全部责任，应不超过您因使用本产品及相关服务期间而支付给我方的费用（如有）。</p>
<p>12. 关于付费购买内容</p>
<p><strong><u>12.1 本产品及相关服务部分内容您需要通过付费以获取，你可以自行选择是否进行付费。请您购买前仔细阅读具体付费内容的功能效果、服务内容、使用规则等，对于具体的付费内容有疑问的，请您在购买前及时咨询我方进行确认。针对部分付费功能存在单独的协议的，您应保证您在购买前已经仔细阅读、理解并同意对应协议的全部内容。</u></strong></p>
<p><strong><u>12.2 如某项具体的服务、权益未标明使用期限、或未明使用期限为“永久”、“无限期”或“无限制”的，则这些服务的使用期限为自您开始使用该服务至该服务在软件停止提供之日为止。</u></strong></p>
<p>13. 未成年人使用条款</p>
<p><strong><u>13.1 若您是未成年人，您应在您的监护人监护、指导下并获得监护人同意的情况下，认真阅读并同意本协议后，方可使用本产品及相关服务。</u></strong></p>
<p>13.2 我方重视对未成年人个人信息的保护，未成年用户在填写个人信息时，请加强个人保护意识并谨慎对待，并应在取得监护人的同意以及在监护人指导下正确使用本产品及相关服务。</p>
<p>13.3 未成年人用户及其监护人理解并确认，如您违反法律法规、本协议内容，则您及您的监护人应依照法律规定承担因此而可能导致的全部法律责任。</p>
<p>14. 其他</p>
<p>14.1 本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国法律。倘若本协议之任何规定因与中华人民共和国法律抵触而无效，则这些条款应在不违反法律的前提下按照尽可能接近本协议原条文目的之原则进行重新解释和适用，且本协议其它规定仍应具有完整的效力及效果。</p>
<p><strong><u>14.2 若您与我方发生任何争议，双方应友好协商解决，协商不成，您同意应将争议提交至****信息科技有限公司所在地有管辖权的法院管辖。</u></strong></p>
<p>14.3 如果您对于本协议及其执行有任何疑问，请您及时与我方取得联系并进行确认：</p>
<p>联系方式：</p>
<p><u><strong>运营主体：杭州**信息科技有限公司</strong></u></p>
<p><u><strong>所在地：浙江省杭州市***</strong></u></p>
<p><u><strong>联系方式：**********@qq.com</strong></u></p>

        </article>
"""

privacy_agreement = """
<div id="write" class=""><h1 id="七仔的桌面工具-隐私政策"><span>七仔的桌面工具 隐私政策</span></h1>
<p><span>****信息科技有限公司及其关联方（以下简称“我方”）作为七仔（七仔的桌面工具）产品及相关服务的运营者，深知个人信息对您的重要性，我方将按照法律法规的规定，保护您的个人信息及隐私安全。</span></p><p><span>下文将帮您详细了解</span><u><span>我方如何收集、使用、共享、转让、披露和储存个人信息；帮您了解查询、访问、删除、更正、撤回授权个人信息的方式。其中，有关您个人信息权益的条款重要内容我方已用</span><strong><span>加粗</span></strong><span>、下划线等形式提示，请特别关注。</span></u></p><p><span>下文将帮助您详细了解以下内容：</span></p><ol start=""><li><strong><span>定义</span></strong></li><li><strong><span>我方如何收集和使用个人信息</span></strong></li><li><strong><span>我方如何使用Cookie等同类技术</span></strong></li><li><strong><span>我方如何共享、转让、公开披露个人信息</span></strong></li><li><strong><span>我方如何存储个人信息</span></strong></li><li><strong><span>我方如何保护个人信息的安全</span></strong></li><li><strong><span>您如何管理您的个人信息</span></strong></li><li><strong><span>未成年人条款（或者：我方如何处理未成年人的信息）</span></strong></li><li><strong><span>隐私政策的修订和通知</span></strong></li><li><strong><span>其他</span></strong></li><li><strong><span>联系我方</span></strong></li></ol><p>&nbsp;</p><h3 id="1定义"><span>1.定义</span></h3><h4 id="11-个人信息"><span>1.1 个人信息</span></h4><p><span>以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。</span></p><h4 id="12-个人敏感信息"><span>1.2 个人敏感信息</span></h4><p><span>是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。</span></p><p>&nbsp;</p><h3 id="2-我方如何收集和使用个人信息"><span>2. 我方如何收集和使用个人信息</span></h3><p><span>我方可能会收集和使用下列与您有关的信息，如果您拒绝提供，您将无法享受相关服务。这些功能包括：</span></p><h4 id="21-帮助您完成注册登录"><span>2.1 帮助您完成注册、登录</span></h4><p><span>（1）您可以通过 七仔（七仔的桌面工具）等创建帐号，并且您可以完善相关的网络身份识别信息（昵称、密码等其他您主动提供的信息）。</span></p><p><span>（2）如果您使用使用第三方帐号登录、使用本产品及相关服务，您将授权我方获取您在第三方平台的部分信息（</span><u><span>仅包含账号、头像、昵称等第三平台授权登录时显示会提供给我方的信息</span></u><span>），用于绑定本产品及相关服务帐号。</span></p><h4 id="22-保证产品功能的正常实现"><span>2.2 保证产品功能的正常实现</span></h4><p><span>为了保证服务的正常运行，我方需要收集以下信息：</span></p><h5 id="221-设备信息"><span>2.2.1 设备信息</span></h5><p><span>为了依据您的具体情况向您提供适配的服务，我方可能会收集您所使用的设备的相关硬件信息。</span></p><h5 id="222-使用信息"><span>2.2.2 使用信息</span></h5><p><span>为了记录服务使用情况，维护服务正常运行，当您使用我方提供的服务时，我方可能会收集您对服务的详细使用/运行情况，可能包括</span><u><span>浏览、点击、交易、访问日期和时间、操作日志信息、崩溃报告</span></u><span>等信息。</span></p><h5 id="223-您主动提供的信息"><span>2.2.3 您主动提供的信息</span></h5><p><span>针对您向我方主动提供的任何个人信息，我方都将采取严格的信息安全措施以保证您的信息安全，我方也仅会为了本隐私政策约定之目的而进行合理的使用，我方的使用行为绝不涉及未经过您允许的个人信息泄露行为。</span></p><h4 id="23-发布与互动"><span>2.3 发布与互动</span></h4><p><span>2.3.1 如果您主动使用了产品及相关服务中的信息发布功能，我方将收集您发布的信息，且可能会展示您的</span><u><span>账号信息、发布内容和信息</span></u><span>。</span></p><p><span>2.3.2 您知悉并同意，对于您在使用产品及/或服务的过程中提供的您的联系方式（例如：</span><strong><span>手机号码</span></strong><span>），我方在运营中可能会向其中的一种或多种发送多类通知，用于提供您可能感兴趣的服务、功能或活动等商业性信息、用户消息告知、身份验证、安全验证、用户使用体验调研等，但请您放心，如您不愿接受这些信息，您可以通过手机短信中提供的退订方式进行退订，也可以直接与我方联系进行退订。</span></p><h4 id="24-帮助您完成支付"><span>2.4 帮助您完成支付</span></h4><p><strong><span>请您注意，支付功能由与我方合作的第三方支付机构向您提供，我方会通过第三方支付机构收集您的支付状态以确认向您提供付费服务。</span></strong><span>第三方支付机构可能需要收集您的姓名、银行卡类型及卡号、有效期及手机号码。</span></p><h4 id="25-提供优质的售中售后服务或解决与您可能产生的争议"><span>2.5 提供优质的售中、售后服务或解决与您可能产生的争议</span></h4><p><span>（1）为了完成服务的购买、续费、升级，我方可能收集您的支付状态以及注册账号的使用情况。</span></p><p><span>（2）当您联系我方要求提供售中、售后服务，或者要求我方处理与您存在的争议、纠纷时，我方可能需要您提供必要的信息以核验您的身份。</span></p><p><span>（3）为了向您提供更优质的售中、售后服务，我方还有可能使用您与我方取得联系时主动提供的其他各项信息。</span></p><h4 id="26-提供网络信息安全保障"><span>2.6 提供网络信息安全保障</span></h4><p><span>为保证您使用我方提供的服务的安全性、稳定性，更好地预防和应对网络欺诈、网络病毒、网络数据的扒取、网络侵入等问题，保护广大用户的个人信息安全、人身财产安全免于侵害，我方可能使用您的个人信息、交易信息、设备信息、使用信息来帮助我方判断您的个人账号安全与否（例如是否存在账号共享、非官方账号等情况）以及账号的使用情况是否会影响我方产品及相关服务的稳定性。</span></p><h4 id="27-优化产品"><span>2.7 优化产品</span></h4><p><span>我方会采取脱敏、去标识化等方式对您的信息进行综合统计、分析加工，以便于我方评估、改善或设计产品、服务及运营活动。</span></p><h4 id="28-收集使用个人信息目的变更"><span>2.8 收集、使用个人信息目的变更</span></h4><p><span>请您了解，随着我方业务的发展，可能会对本产品及相关服务的功能和提供的服务有所调整变化。原则上，当新功能或服务与我方当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我方收集、使用您的个人信息，会再次进行告知，并征得您的同意。</span></p><p><strong><span>但请您理解，由于我方向您提供的服务是不断更新和发展的。如您选择使用了前述说明中尚未涵盖的其他服务，基于该服务我方需要收集您的信息的，我方会通过页面提示、交互流程、协议约定的方式另行向您说明信息收集的范围和目的，并征得您的同意。我方会按照本政策以及相应的用户协议约定使用、存储、对外提供及保护您的信息；如果您选择不提供前述信息，您可能无法使用某项或某部分服务，但不影响您使用我方的提供的其他服务。</span></strong></p><h4 id="29-依法无需征得同意收集和使用的个人信息"><span>2.9 依法无需征得同意收集和使用的个人信息</span></h4><p><span>请您理解，在下列情形中，根据法律法规及相关国家标准，我方收集和使用您的个人信息无需征得您的授权同意：</span></p><p><span>（1）与国家安全、国防安全直接相关的； </span>
<span>（2）与公共安全、公共卫生、重大公共利益直接相关的； </span>
<span>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的； </span>
<span>（4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； </span>
<span>（5）所收集的您的个人信息是您自行向社会公众公开的； </span>
<span>（6）从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道； </span>
<span>（7）根据您的要求签订或履行合同所必需的； </span>
<span>（8）用于维护产品及相关服务的安全稳定运行所必需的，例如发现、处置产品及相关服务的故障； </span>
<span>（9）为合法的新闻报道所必需的； </span>
<span>（10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的； </span>
<span>（11）法律法规规定的其他情形。</span>
</p><p><u><strong><span>特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份（包括通过脱敏、去标识化处理后无法单独或结合其他信息识别到您的个人身份的信息），其不属于法律意义上您的个人信息。</span></strong></u></p><p>&nbsp;</p><h3 id="3-我方如何使用cookie等同类技术">
<span>3. 我方如何使用Cookie等同类技术</span></h3><p><span>Cookie和设备信息标识等同类技术是互联网中普遍使用的技术。当您使用本产品及相关服务时，我方可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符，以收集、标识您访问、使用本产品时的相关信息。我方承诺，不会将Cookie用于本隐私政策所述目的之外的任何其他用途。我方使用Cookie主要为了实现以下功能或服务：</span></p><h4 id="31-保障产品与服务的安全高效运转">
<span>3.1 保障产品与服务的安全、高效运转</span></h4><p><span>我方可能会设置认证与保障安全性的Cookie 或匿名标识符，使我方确认您是否安全使用服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我方改进服务效率，提升登录和响应速度。</span></p><h4 id="32-为您推荐展示推送您更感兴趣的内容或帐号"><span>3.2 为您推荐、展示、推送您更感兴趣的内容或帐号</span></h4><p><span>我方可能会利用此类技术了解您的偏好和使用习惯，进行数据分析，以改善产品服务、推荐用户感兴趣的信息或功能，并优化您对广告的选择。</span></p><h4 id="33-探索更好的服务方式"><span>3.3 探索更好的服务方式</span></h4><p><span>在本产品及相关服务的分享页中，我方可能会使用Cookie对浏览活动进行记录，用于向您推荐信息和排查崩溃、延迟的相关异常情况以及探索更好的服务方式。</span></p><p>&nbsp;</p><h3 id="4-我方如何共享转让公开披露个人信息"><span>4. 我方如何共享、转让、公开披露个人信息</span></h3><h4 id="41-共享"><span>4.1 共享</span></h4><p><span>（1）我方可能会按照法律法规的要求或强制性的政府要求或司法裁定等，与相关的第三方共享您的个人信息。</span></p><p><span>（2）在征得明确同意的情况下共享：征得您的明确同意后，我方可能会与其他方共享您的个人信息。 </span></p><p><span>（3）与关联公司间共享：</span><u><span>为便于我方向您提供产品或服务，推荐您可能感兴趣的信息，识别使用异常，保护我方关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我方的关联公司和/或其指定的服务提供商共享。</span></u><span>我方只会共享必要的个人信息，且受本隐私权政策中所声明目的的约束，如果我方共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。 </span></p><p><span>（4）与授权合作伙伴共享：我方可能委托授权合作伙伴为您提供某些服务或代表我方履行某些职能，我方仅会出于本隐私政策中明确、合法、正当的目的共享您的信息，且授权合作伙伴不得将该等信息用于其他任何目的。</span></p><p><span>目前，我方的授权合作伙伴包括以下类型：</span></p><p><span>①供应商、服务提供商和其他合作伙伴。该等合作伙伴向我方提供数据存储等技术基础设施服务、收集分析我方的服务使用情况、并协助我方提供客户服务、提供支付便利或展开研究和调查，该等供应商、服务提供商和其他合作伙伴将仅在合法合规的前提下收集/获得您的个人信息。</span></p><p><span>我方会对合作伙伴获取有关信息的应用程序接口（API）、软件工具开发包（SDK）进行严格的安全检测，并要求其按照本隐私政策来处理可能获得的个人信息。</span></p><h4 id="42-转让"><span>4.2 转让</span></h4><p><span>（1）我方不会转让您的个人信息给任何其他第三方，除非征得您的明确同意。</span></p><p><span>（2）随着我方业务的持续发展，我方将有可能进行合并、收购、资产转让，您的个人信息有可能因此而被转移。在发生前述变更时，我方将按照法律法规及不低于本隐私政策所载明的安全标准，要求继受方保护您的个人信息，否则我方将要求继受方重新征得您的授权同意。</span></p><h4 id="43-公开披露"><span>4.3 公开披露</span></h4><p><span>（1）我方不会公开披露您的信息，除非遵循国家法律法规规定或者征得您的同意。我方公开披露您的个人信息将采用符合行业内标准的安全保护措施。</span></p><p><span>（2）对违规帐号、欺诈行为进行处罚公告时，我方可能会披露相关帐号的信息。</span></p><h4 id="44-委托处理"><span>4.4 委托处理</span></h4><p><span>为了提升信息处理效率，降低信息处理成本，或提高信息处理准确性，我方有可能会委托有能力的我方的关联公司或其他专业机构代表我方来处理信息。我方会要求受托公司严格遵守保密义务，禁止其将这些信息用于您未授权的用途。我方承诺，在委托关系解除时，受托公司将不再保存有关个人信息。</span></p><h4 id="45-共享转让公开披露的个人信息时事先征得授权同意的例外">
<span>4.5 共享、转让、公开披露的个人信息时事先征得授权同意的例外</span></h4><p><span>请您理解，在下列情形中，根据相关法律法规及国家标准，我方共享、转让、公开披露您的个人信息无需事先征得您的授权同意：</span></p><p><span>（1）与国家安全、国防安全直接相关的；</span></p><p><span>（2）与公共安全、公共卫生、重大公共利益直接相关的；</span></p><p><span>（3）与犯罪侦查、起诉、审判和判决执行等司法或行政执法直接相关的；</span></p><p><span>（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</span></p><p><span>（5）您自行向社会公众公开的个人信息；</span></p><p><span>（6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</span></p><p><span>（7）与我方履行法律法规规定的义务相关的。</span></p><p><span>请知悉，若我方对个人信息采取技术措施和其他必要措施进行处理，设计的数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。</span></p><p>&nbsp;</p><h3 id="5-我方如何存储个人信息"><span>5. 我方如何存储个人信息</span></h3><h4 id="51-存储地点"><span>5.1 存储地点</span></h4><p><span>我方依照中华人民共和国相关法律法规的规定，将在境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前，我方不会将上述信息传输至境外，如果我方向境外传输，我方将会遵循相关国家规定或者征求您的同意。</span></p><h4 id="52-存储期限"><span>5.2 存储期限</span></h4><p><span>我方仅在达成本政策所述目的所需的期限内保留您的个人信息。超出必要期限后，我方将对您的个人信息进行删除或匿名化处理，但法律有强制留存要求的除外。在下列情况下，我方可能因需符合法律要求，更改个人信息的存储时间： </span></p><p><span>（1）为遵守适用的法律法规规定，例如，《中华人民共和国网络安全法》第二十一条第三款要求监测、记录网络运行状态、网络安全事件的技术措施的网络日志留存不得少于六个月；《中华人民共和国电子商务法》要求商品和服务信息、交易信息保存时间自交易完成之日起不少于三年；</span></p><p><span>（2） 为遵守法院判决、裁定或其他法律程序的规定； </span></p><p><span>（3） 为遵守政府机关或法定授权组织的要求； </span></p><p><span>（4） 为执行平台协议或本政策、维护社会公共利益，保护公司及公司关联公司、其他用户或雇员的人身安全或其他合法权益所合理必需的用途。</span></p><p>&nbsp;</p><h3 id="6-我方如何保护个人信息的安全"><span>6. 我方如何保护个人信息的安全</span></h3><h4 id="61-安全措施"><span>6.1 安全措施</span></h4><p><span>我方非常重视您个人信息的安全，将努力采取合理的安全措施（包括技术方面和管理方面）来保护您的个人信息，防止您提供的个人信息被不当使用或在未经授权的情况下被访问、公开披露、使用、修改、损坏、丢失或泄漏。</span></p><h4 id="62-安全保护机制"><span>6.2 安全保护机制</span></h4><p><span>我方会使用加密技术、匿名化处理及相关合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。</span></p><h4 id="63-应急处理预案"><span>6.3 应急处理预案</span></h4><p><span>我方会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止这些安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失）后，我方将按照法律法规的要求，及时向您告知，难以逐一告知时，我方会采取合理、有效的方式发布公告。同时，我方还将按照相关监管部门要求，上报用户信息安全事件的处置情况。</span></p><h4 id="64-例外告知"><span>6.4 例外告知</span></h4><p><span>（1）请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我方将尽力确保您提供给我方的个人信息的安全性。</span></p><p><span>（2）您一旦离开本产品及相关服务，浏览或使用其他网站、服务及内容资源，我方将没有能力和直接义务保护您在本产品及相关服务之外的软件、网站提交的任何个人信息，无论您登录、浏览或使用上述软件、网站是否基于本产品及相关服务的链接或引导。</span></p><p>&nbsp;</p><h3 id="7-您如何管理您的个人信息"><span>7. 您如何管理您的个人信息</span></h3><h4 id="71-账号信息"><span>7.1 账号信息</span></h4><p><span>您可以根据网站、产品内的指引，查询、访问、删除、更正您的个人信息、执行账号注销，如您对此有任何疑问，您可以通过我方提供的官方联系方式与我方联系，我方将在十五个工作日内响应并处理您的问题。</span></p><h4 id="72-修改初始注册信息"><span>7.2 修改初始注册信息</span></h4><p><span>出于安全性和身份识别的考虑，您可能无法自主修改注册时提交的某些初始注册信息（如实名认证后信息）；如您确有必要修改该类信息，请您通过电子邮件：</span><a href="mailto:service@u.tools"><span>service@u.tools</span></a><span> 联系我方，我方将尽快审核所涉问题，并由专人验证您的用户身份后及时予以回复。</span></p><p><span>账号信息的查询、访问、删除、更正您可以根据网站、产品内的指引，查询、访问、删除、更正您的个人信息，如您对此有任何疑问，您可以通过我方提供的官方联系方式与我方联系，我方将在十五个工作日内相应并处理您的问题。</span></p><h4 id="73-投诉举报"><span>7.3 投诉举报</span></h4><p><span>您可以按照我方公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，您可以通过我方提供的官方联系方式向我方发起投诉或举报。我方核查后会在30日内反馈您的投诉与举报。</span></p><p>&nbsp;</p><h3 id="8-未成年人条款"><span>8. 未成年人条款</span></h3><p><span>我方深知保护儿童（根据《儿童个人信息网络保护规定》的规定，下文的儿童均指未满十四周岁的未成年人）个人信息安全和隐私的重要性。我方另行设置了《儿童隐私保护政策》，本协议与《儿童隐私保护政策》不符的，以《儿童隐私保护政策》为准。</span></p><p><span>（1）我方处理未成年人个人信息时，将遵循合法、正当和必要的原则。</span></p><p><span>（2）若您是未成年人，在使用本产品及相关服务及相关服务前，应在您的父母或其他监护人监护、指导下共同阅读并同意本隐私政策。</span></p>
<p><span>（3）我方根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、共享或披露未成年人的个人信息；如果我方发现在未事先获得可证实的父母或其他监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。</span></p><p><span>（4）若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过本隐私政策公示的联系方式与我方联系。</span></p><p>&nbsp;</p><h3 id="9-隐私政策的修订和通知">
<span>9. 隐私政策的修订和通知</span></h3><p><span>（1）为了给您提供更好的服务，本产品及相关服务将不时更新与变化，我方会适时对本隐私政策进行修订，这些修订构成本隐私政策的一部分并具有等同于本隐私政策的效力，未经您明确同意，我方不会削减您依据当前生效的本隐私政策所应享受的权利。</span></p><p><span>（2）本隐私政策更新后，我方会在本产品及相关服务发出更新版本，并通过其他适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。</span></p><p>&nbsp;</p><h3 id="10-其他"><span>10. 其他</span></h3><h4 id="101-权限获取说明"><span>10.1 权限获取说明</span></h4><p><span>（1）读取及写入存储器权限：当您使用本产品及相关服务时，会向您申请获取此权限，目的是为了保证本产品及相关服务的平稳运行。我方承诺仅读取和缓存必要的信息。</span></p><p><span>（2）麦克风权限：当您需要与客服进行语音沟通或上传音频文件时，使用需要语音输入的功能时，您需要开启此项权限，并使用麦克风设备进行语音输入。请您注意，如您选择不开启以上一项或多项权限，您将无法使用与对应权限相关的特定服务，但不影响您使用其他服务。</span></p><h4 id="102-隐私政策查看"><span>10.2 隐私政策查看</span></h4><p><span>您可以在本产品及相关服务的对应页面内查看本隐私政策。我方鼓励您在每次使用本产品及相关服务时都查阅我方提供的隐私政策。</span></p><p>&nbsp;</p><h3 id="11-联系我方"><span>11. 联系我方</span></h3><p><span>如果您对个人信息保护问题有投诉、建议、疑问，您可以将问题发送至待电子邮箱：</span><a href="mailto:service@u.tools"><span>service@u.tools</span></a><span>，或邮寄至下列地址：</span></p><p><strong><u><span>福建省福州市仓⼭区金洲北路联合动力产业园2号楼509</span></u></strong></p><p><span>****信息科技有限公司 法务部</span></p><p><span>联系电话：13860677400</span></p><p><span>我方将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内回复。</span></p><p>&nbsp;</p><p>&nbsp;</p><h1 id="儿童隐私保护政策"><span>儿童隐私保护政策</span></h1><p><span>****信息科技有限公司及其关联方（以下简称“我方”）作为七仔（七仔的桌面工具）产品及相关服务（以下简称本产品及相关服务）的运营者，深知保护儿童（根据《儿童个人信息网络保护规定》的规定，下文的儿童均指未满十四周岁的未成年人）个人信息安全和隐私的重要性。在《隐私政策》的基础上，我方希望通过《儿童隐私保护政策》（以下简称“本政策”）说明我方在收集和使用儿童个人信息时对应的处理规则等相关事宜。</span><strong><span>在使用本产品及相关服务前，您作为儿童（您孩子）的父母或其他监护人（以下统称为“监护人”），务必仔细阅读并透彻理解本政策，特别是以粗体/下划线标识的条款应重点阅读，在确认充分理解并同意全部条款后再开始使用或允许您的孩子使用。</span></strong></p><p><span>监护人特别说明：</span></p><p><span>为了维护您孩子的合法权益，我方需要您的理解与配合，请您确保您的孩子在您的监护下共同阅读并接受本政策，并在您的同意和指导下使用本产品及相关服务、提交个人信息。</span><u><span>如果您不同意本政策的内容，请您要求您的孩子立即停止访问/使用本产品及相关服务。若您选择同意本政策，或者您的孩子存在使用本产品及相关服务、提交个人信息的行为，都表示您同意我方按照本政策（包括更新版本）收集、使用、共享、转让、披露和储存您孩子的个人信息。</span></u></p><p><span>儿童特别说明：</span></p><p><u><span>任何儿童参加网上活动都应事先取得监护人的同意。如果您是儿童，在您使用本产品及相关服务、提交个人信息之前，请您通知您的监护人共同阅读本政策，寻求您的监护人的同意和指导。</span></u></p><p><span>本政策适用于我方在中华人民共和国境内通过网络从事收集、使用、储存和分享儿童个人信息等活动。本政策为在《隐私政策》基础上制定的特别规则，如与《隐私政策》存在不一致的，以本政策为准；如本政策未提及或列明的，则参照适用《隐私政策》。</span></p><p><span>请您理解，本政策仅适用于我方所收集的个人信息，并不适用于任何第三方提供的服务或第三方的信息使用规则。我方可能为儿童接入或链接至第三方提供的服务（包括网站或其他服务形式）。请查阅《隐私政策》“第三方SDK目录”，详细了解我方接入或链接的第三方服务类型。该第三方服务由相关的第三方负责运营。儿童使用该第三方的服务、向该第三方提供个人信息，须受该第三方自己的服务条款及隐私政策约束，建议您和您的孩子仔细阅读该第三方的隐私政策，以保护儿童的合法权益。</span></p><p><span>在阅读完本政策后，如您对本政策或与本政策相关的事宜有任何问题，可通过我方提供的官方联系方式与我方联系，我方会尽快为您解答。</span></p><p><strong><span>本政策将帮助您了解以下内容：</span></strong></p><ol start=""><li><p><span>我方如何收集和使用儿童个人信息</span></p></li><li><p><span>我方如何共享、转让、公开披露儿童个人信息</span></p></li><li><p><span>我方如何储存和保护儿童个人信息</span></p></li><li><p><span>我方如何管理儿童个人信息</span></p></li><li><p><span>本政策的修订和通知</span></p></li><li><p><span>如何联系我方</span></p><p>&nbsp;</p></li></ol><p><span>一、我方如何收集和使用儿童个人信息</span></p>
<p><span>（一）我方将遵循正当必要、知情同意、目的明确、安全保障、依法利用的原则，严格履行法律法规规定的儿童个人信息保护义务与责任，在征得监护人的同意后收集和使用儿童个人信息。若您在使用本产品及相关服务时主动向我方提供您孩子的个人信息，则表明您已经同意我方收集和按照本政策的内容使用您孩子的个人信息。</span></p><p><span>（二）您或您的孩子在使用我方的产品及服务过程中，为更好地向您或者您的孩子提供本产品及相关服务，我方可能还会收集和使用其他儿童个人信息，有关具体的使用目的、收集个人信息的范围以及拒绝提供相应信息的后果，具体请参照《隐私政策》“我方如何收集和使用个人信息”章节。</span></p><p><u><span>请您注意，绝大多数情形下我方无法识别且不会判断收集和处理的个人信息是否属于儿童个人信息，我方将按照《隐私政策》收集和处理用户的个人信息。</span></u></p><p><span>此外，我方也会通过Cookies、SDK等同类技术自动收集您或您孩子的个人信息，您可以查阅《隐私政策》“我方如何使用Cookie等同类技术”部分进行详细了解。如我方需要超出上述范围收集和使用儿童个人信息，我方将再次征得监护人的同意。</span></p><p><span>（三）征得授权同意的例外：</span></p><p><span>根据相关法律法规规定，以下情形中收集儿童的信息无需征得儿童监护人的授权同意：</span></p><ol start=""><li><span>与我方履行法律法规规定的义务相关的；</span></li><li><span>与国家安全、国防安全、公共安全、公共卫生、重大公共利益有关的；</span></li><li><span>与犯罪侦查、起诉、审判和判决执行等有关的；</span></li><li><span>出于维护儿童的生命、财产等重大合法权益但又很难得到监护人同意的；</span></li><li><span>所收集的信息是儿童或监护人自行向社会公众公开的；</span></li><li><span>从合法公开披露的信息中收集信息的，如合法的新闻报道、政府信息公开等渠道；</span></li><li><span>根据与您或您的孩子签订和履行相关协议或其他书面文件所必需的；</span></li><li><span>用于维护我方的产品及服务的安全稳定运行所必需的，例如发现、处置我方的产品及服务的故障；</span></li><li><span>学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的信息进行去标识化处理的；</span></li><li><span>法律法规规定的其他情形。</span></li></ol><p>&nbsp;</p><p><span>二、我方如何共享、转让、公开披露儿童个人信息</span></p><p><span>（一）我方承诺对儿童个人信息进行严格保密，仅在符合本政策说明和您明确授权同意的情况下对外共享儿童个人信息。为了提升信息处理效率，降低信息处理成本，或提高信息处理准确性，我方有可能会委托有能力的我方的关联公司或其他专业机构代表我方处理儿童个人信息，详情请参见《隐私政策》“我方如何共享、转让、公开披露个人信息”章节。如果为了本政策所述目的而需要将儿童个人信息共享至第三方，我方将对第三方的收集和使用行为进行安全评估，我方将要求第三方对儿童个人信息采取严格的保护措施并履行以下义务：</span></p><ol start=""><li><span>按照法律、行政法规的规定和我方的要求处理儿童个人信息；</span></li><li><span>协助我方回应儿童监护人提出的申请；</span></li><li><span>采取措施保障信息安全，并在发生儿童个人信息泄露安全事件时，及时向我方反馈；</span></li><li><span>委托关系解除时及时删除儿童个人信息；</span></li><li><span>不得转委托；</span></li><li><span>其他依法应当履行的儿童个人信息保护义务。</span></li></ol><p><span>（二）共享、转让、公开披露儿童个人信息时事先征得授权同意的例外以下情形中，共享、转让、公开披露儿童的信息无需事先征得监护人的授权同意： </span></p><ol start=""><li><span>与国家安全、国防安全有关的； </span></li><li><span>与公共安全、公共卫生、重大公共利益有关的； </span></li><li><span>与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的； </span></li><li><span>出于维护儿童或其他个人的生命、财产等重大合法权益但又很难得到监护人同意的； </span></li><li><span>儿童或监护人自行向社会公众公开的信息； </span></li><li><span>从合法公开披露的信息中收集信息的，如合法的新闻报道、政府信息公开等渠道。</span></li></ol><p>&nbsp;</p><p><span>三、我方如何储存和保护儿童个人信息</span></p><p><span>（一）我方会采取合理可行的措施，尽力避免收集和处理无关的儿童的个人信息。</span><u><span>我方只会在达成本政策所述目的所必需的期限内保留儿童的个人信息，除非法律有强制的留存要求。</span></u><span>关于我方如何确定儿童个人信息存储期限请参照《隐私政策》“我方如何保护个人信息的安全”。如我方终止服务或运营，我方将及时停止继续收集儿童个人信息的活动，同时会遵守相关法律法规要求提前向监护人通知，并在终止服务或运营后对儿童的个人信息进行删除或匿名化处理，但法律法规或监管部门另有规定的除外。</span></p><p><span>（二）我方将严格设定儿童个人信息访问权限，控制儿童个人信息知悉范围，以最小授权为原则，对工作人员处理儿童个人信息的行为进行记录和管控，避免违法复制、下载儿童个人信息。我方会制定应急处理预案，并在发生儿童个人信息安全事件时立即启动应急预案，采取补救措施，努力阻止这些安全事件的影响和后果扩大。造成或者可能造成严重后果的，我方会将事件相关情况以邮件、信函、电话、推送通知等方式告知儿童及其监护人，难以逐一告知的，我方将采取合理、有效的方式发布相关警示信息。</span></p><p>&nbsp;</p><p><span>四、我方如何管理儿童个人信息</span></p><p><span>（一）为了尽可能保证监护人和儿童可以访问、更正、删除儿童个人信息，以及注销儿童注册帐号，我方将在本产品及相关服务中采取适当的操作直营，您也可以通过我方提供的官方联系方式与我方联系。请您知悉，在对儿童个人信息进行相关操作时，我方可能会要求监护人和/或儿童进行身份验证，以保障信息安全。更多具体内容请参照《隐私政策》“您如何管理您的个人信息”。</span></p><p><span>（二）在下列情形下，您或您的孩子可以通过我方提供的官方联系方式与我方联系，要求删除相应的儿童个人信息：</span></p><ol start=""><li><span>我方违反法律、行政法规的规定或者双方的约定收集、存储、使用、对外提供儿童个人信息的；</span></li>
<li><span>超出目的范围或者必要期限收集、存储、使用、对外提供儿童个人信息的；</span></li><li><span>您撤回同意的；</span></li><li><span>您或您的孩子通过注销等方式终止使用本产品及相关服务的。</span></li></ol><p>&nbsp;</p><p><span>五、本政策的修订和通知</span></p><p><span>我方可能会根据产品或服务的更新情况及法律法规的相关要求适时修改本政策的条款，该等修改构成本政策的一部分。未经儿童及其监护人明确同意，我方不会削减您和您的孩子依据当前生效的本儿童隐私保护政策所应享受的权利。通知方式详见《隐私政策》“隐私政策的修订和通知”。</span></p><p>&nbsp;</p><p><span>六、如何联系我方</span></p><p><span>如果您对个人信息保护问题有投诉、建议、疑问，您可以将问题发送至待电子邮箱：</span>
<a href="mailto:**********@qq.com"><span>**********@qq.com</span></a><span>，或邮寄至下列地址：</span></p><p><strong><u>
<span>浙江省杭州市***</span></u></strong></p><p><span>****信息科技有限公司 法务部</span></p>
<p><span>联系电话：***********</span></p><p><span>我方将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内回复。</span></p></div>
"""