
update_map_info = {
    "v0.1.0": [
        "beta版本初版"
    ],
    "v0.1.1": [
        "调整卡片加载方式"
    ],
    "v0.2.0": [
        "卡片商店更新，可以在线安装和更新卡片",
        "面板顶部增加导航栏,可以导航官网和收起面板",
        "增加引导页面",
        "软件安装方式调整为安装包安装",
        "增加开机自启动设置",
        "适配所有的弹出框样式",
        "托盘区菜单和菜单样式调整",
        "完善音乐卡片功能",
        "实现从云端恢复数据功能",
        "天气卡片默认城市调整为北京",
        "等待日卡片的适配和完善",
        "喝水卡片的记录窗口进行优化",
        "文字查看窗口增加刷新功能",
        "电子木鱼卡片增加刷新按钮",
        "工具、信息、游戏窗口顶部增加来源链接",
        "部分深色主题适配问题修复",
        "增加浅色(亚力克、半透明)和深色模式的选择",
        "其他优化和问题修复"
    ],
    "v0.2.1": [
        "支付系统"
    ],
    "v0.3.0": [
        "问题反馈功能",
        "数据存储方式修改",
        "设置页面的更新记录改为检查更新",
    ],
    "v0.3.1": [
        "部分问题修复"
    ],
    "v0.3.2": [
        "新增卡片设计器中卡片互换的功能",
        "密码输入框增加显示/隐藏密码功能",
        "注册时增加协议同意确认弹框",
        "调整续费和开通会员的按钮位置",
        "设置菜单中增加版本信息和关于我们功能",
        "对音乐卡片上方的歌单列表和歌曲列表增加文字展示",
        "智能助手模块图片修改为官方图标",
        "优化卡片设计器和卡片商店的图片加载速度",
        "修复输入密码位数和提示不匹配问题",
        "修复开通会员成功但返回后未显示会员状态的问题",
        "修复重新登录后快捷键未生效的问题",
        "修复界面设置中菜单位置未修改的问题",
        "修复部分界面中输入框未做字数上限的问题",
        "修复音乐导入后未展示的问题",
        "修复弹出框在主窗口贴边后关闭时出现下拉框未关闭的问题",
        "尝试修复偶发的弹出框问题",
    ],
    "v0.3.3": [
        "确认卡片设计前增加检测重叠的逻辑",
        "卡片设计器增加最大宽度限制",
        "发验证码前先校验用户是否存在",
        "密码和其他输入框搞对齐",
        "登录的密码框取消实时校验",
        "小说模块把滚动条放到右侧",
        "热搜模块增加滚动条",
        "图片查看增加放大缩小功能",
        "部分快捷键被占用时提示用户",
        "修复小说模块在软件退出后未存储状态的问题",
        "修复卡片置换后可能会重叠的问题",
        "修复卡片设计器增/缩宽度会闪退的问题",
        "修复频繁切换订阅计划出现的错误",
        "修复意见反馈没适配主题的问题",
        "修复部分控件高度问题导致的圆角变为方角问题",
        "修复关于我们界面展示版本错误问题",
    ],
    "v0.4.0": [
        "智能对话从临时网页模式改为灵卡面板对话框模式",
        "增加会员专属工单功能"
    ],
    "v0.4.1": [
        "增加邀请用户功能，邀请成功双方均可获得周卡会员",
        "简化密码规范（英文字母+数字）",
        "优化登录界面输入体验，回车可跳到下一个输入框，最后的输入框触发最终操作(登录注册等)",
        "会员权益重新排序、增加点击展示详情功能",
        "用户头像调整，分别展示通用头像和会员头像",
        "智能对话的头像更换为通用/会员头像，AI头像改为每个AI对应的头像",
        "智能对话的右键菜单适配中文",
        "现在改为必须用管理员权限启动软件",
        "音乐卡片的封面改为圆角",
        "修复用户智能对话次数超限的报错问题",
        "修复卡片设计器卡片互换可能导致的超出边界问题",
        "修复卡片定时刷新未生效的问题",
        "修复退出登录时登录界面和之前不一致的问题，且现在会保存上一个用户的主题到系统",
        "修复登录时退出选取消依然会退出的问题",
    ],
    "v0.4.2": [
        "修复注册时邀请码未生效的问题",
        "修复卡片设计器可能无法添加新卡片的问题"
    ],
    "v0.4.3": [
        "信息卡片将文字分类放在图片分类前、删除图片分类的读懂世界和星座运势",
        "同步请求均转换为异步请求",
        "对所有输入界面做体验优化，回车可跳到下一个输入框，最后的输入框触发最终操作",
        "智能对话中不能输入和发送消息、切换模型",
        "智能对话窗口限制只能存在一个",
        "智能对话增加停止按钮",
        "更新处要增加红点提示",
        "卡片商店更新后关闭卡片设计器时进行提示",
        "去掉热搜卡片下面的临时横线",
        "修复强制更新错误的问题",
    ],
    "v0.4.4": [
        "智能对话增加异常结束提示",
        "对于第三方窗口的标题右侧增加问号图标，解释是第三方，并提示点击标题可以跳转",
        "同步时要对卡片数据进行下发",
        "同步输入框和日期选择框的主题",
        "部分卡片限制同时只能存在一个",
        "卡片商店的卡片优先展示2*2大小的",
        "文字弹窗窗口的复制按钮增加反馈提示弹窗",
        "修复卡片设计器安装卡片点击确认后再关闭会再弹窗的问题",
        "修复小说首次加载时滚动条未更新的问题",
    ],
    "v0.4.5": [
        "卡片商店增加卡片详情界面",
        "部分链接文字和相对重要的按钮增加悬浮时将光标改为手型",
        "修复卡片设计器退出后菜单指示条位置不对的问题",
        "修复检查更新后未即时刷新更新提示红点的问题",
    ],
    "v0.4.6": [
        "适配Win11系统的分屏功能：窗口右上角大小切换按钮或快捷键Win+Z",
        "修复亚克力模式下的窗口移动和缩放卡顿的问题",
    ],
    "v0.4.7": [
        "完善会员各个权益说明",
        "音乐卡片没有歌曲时点击播放不修改播放按钮状态",
        "卡片商店的卡片详情适配深色模式",
        "用户->数据界面的[vip]改为图标形式，设置部分功能增加vip标识",
        "修复注册登录后天气和工作日卡片为空的问题",
        "修复弹窗全屏移动时会变蓝色的问题",
        "修复深色背景下检查更新弹出窗口的四个角是白色的问题",
        "修复修改主题设置未生效的问题",
    ],
    "v0.4.8": [
        "修复深色模式下托盘图标菜单文字颜色的问题",
        "修复弹出窗口变成非亚克力背景的问题",
        "修复深色模式下注销再登录切换到浅色模式出现的主题问题",
    ],
    "v0.5.0": [
        "菜单新增翻译模块，移除工具模块的翻译页签",
        "对部分工具模块和游戏模块打开的界面的主题进行适配",
        "主题设置功能开放为免费",
        "优化智能对话体验，平滑滚动",
        "对历史上的今天进行调整",
    ],
    "v0.5.1": [
        "智能对话模块增加智能体选择",
        "对浅色模式下翻译上方的提示条底色进行调整",
        "面板默认位置改在屏幕左侧",
        "修复深色模式启动时死角为方角的问题",
    ],
    "v0.5.2": [
        "登录和保持的令牌逻辑调整",
    ],
    "v0.5.3": [
        "对上一个版本进行修复和调整",
    ],
    "v0.5.4": [
        "调整引导程序的图片",
        "禁用退出登录后显示和隐藏主界面的功能",
        "支付界面的用户协议修改跳转链接",
        "修复会员成功后未刷新界面的问题",
        "修复重新登录后翻译卡片的中英互换文字重影问题",
        "修复重新登录后会员工单的vip角标未显示的问题",
    ],
    "v0.5.5": [
        "默认快捷键调整为Ctrl+1,引导程序的界面响应调整",
        "适配云端字段调整",
        "修复会员工单打开报错的问题",
    ],
    "v0.5.6": [
        "增加查看订阅记录功能",
        "登录界面弹窗几秒后自动关闭",
        "调整会员权益说明，增加查看详细权益按钮",
        "修复使用邀请码注册登录失败的问题",
    ],
}

update_map_date = {
    "v0.1.0": "2025-03-21",
    "v0.1.1": "2025-03-21",
    "v0.2.0": "2025-04-14",
    "v0.2.1": "2025-06-19",
    "v0.3.0": "2025-07-03",
    "v0.3.1": "2025-07-03",
    "v0.3.2": "2025-07-08",
    "v0.3.3": "2025-07-09",
    "v0.4.0": "2025-07-13",
    "v0.4.1": "2025-07-15",
    "v0.4.2": "2025-07-15",
    "v0.4.3": "2025-07-16",
    "v0.4.4": "2025-07-18",
    "v0.4.5": "2025-07-20",
    "v0.4.6": "2025-07-20",
    "v0.4.7": "2025-07-23",
    "v0.4.8": "2025-07-24",
    "v0.5.0": "2025-07-26",
    "v0.5.1": "2025-07-27",
    "v0.5.2": "2025-07-30",
    "v0.5.3": "2025-07-30",
    "v0.5.4": "2025-07-31",
    "v0.5.5": "2025-08-01",
    "v0.5.6": "2025-08-02",
}


def get_update_info():
    update_info = ""
    # 提取所有版本号并排序（从新到旧）
    sorted_versions = sorted(
        update_map_info.keys(),
        key=lambda v: tuple(map(int, v[1:].split('.'))),  # 将 "v0.3.2" 转换为 (0,3,2)
        reverse=True  # 降序排列（最新在前）
    )

    for version in sorted_versions:
        update_info += "## " + version + ":\n"
        for item in update_map_info[version]:
            if item:  # 跳过空字符串
                update_info += "* " + item + "\n"
        update_info += "\n"
    return update_info


def get_current_version():
    return list(update_map_info.keys())[-1]


def gen_download_history_md():
    # 提取所有版本号并排序（从新到旧）
    sorted_versions = sorted(
        update_map_info.keys(),
        key=lambda v: tuple(map(int, v[1:].split('.'))),  # 将 "v0.3.2" 转换为 (0,3,2)
        reverse=True  # 降序排列（最新在前）
    )
    update_info = ""
    for version in sorted_versions:
        update_info += "#### 版本 " + version + " - " + update_map_date[version] + "\n"
        for item in update_map_info[version]:
            if item:  # 跳过空字符串
                update_info += "- " + item + "\n"
        update_info += "\n"
    return update_info

# print(gen_download_history_md())
