
update_map_info = {
    "v1.0.0": [
        "提交第一个版本",
    ],
    "v1.1.0": [
        "进行代码签名避免被杀软误报",
        "调整软件图标，托盘图标取消设置颜色功能",
        "增加推广邀请码功能",
        "增加截图翻译功能，同时增加快捷键截图翻译",
        "歌曲模块的图标增加文字显示",
        "简化密码格式、修改密码提示、将忘记密码的密码改为新密码",
        "翻译模块将有道改为默认，增加回车翻译功能",
        "调整翻译和智能对话上方的次数提示信息",
        "加速图片查看的加载速度，并避免失败",
        "托盘右键的关于我们从浏览器链接改为窗口展示信息",
        "打开卡片商店时增加加载动画",
        "智能对话的智能体部分降低输入框的高度",
        "加入用户交流群按钮从弹窗转为跳转到官网关于页",
        "调整主卡片侧边菜单排列顺序",
        "对于低分辨率做单独的设计布局",
        "隐藏安装时的部分弹窗",
        "修复智能对话之前的对话会重复展示的问题",
        "修复软件安装快完成时会有错误提示弹窗的问题",
        "修复软件托盘图标右键退出失效的问题",
        "修复音乐卡片点击进度条闪退的问题",
        "修复判断占用快捷键时占用的可能是本身的问题",
        "修复待办事项的通知未触发的问题",
    ],
    "v1.1.1": [
        "加快数据同步的频率",
        "修复同步时大小或部分数据同步失败的问题",
    ],
    "v1.1.2": [
        "调整软件内部分信息",
        "修复同步时出现的界面弹出问题",
    ],
    "v1.1.3": [
        "修复检查更新部分的问题",
    ],
    "v1.1.4": [
        "修复截图OCR翻译界面无法相应Esc的问题",
    ],
    "v1.1.5": [
        "信息聚合模块增加处理器和显卡的天梯图功能",
    ],
    "v1.1.6": [
        "优化图片查看窗口的操作逻辑",
        "对待办事项模块进行部分调整优化",
        "修复登录界面的检查更新功能",
    ],
    "v1.1.7": [
        "工具箱模块增加【记仇生成器】功能",
    ],
    "v1.1.8": [
        "修复待办事项无法新建待办的问题",
    ],
    "v1.1.9": [
        "工具箱模块增加【这班值不值得上】功能",
        "工具箱模块增加【中国家庭称谓计算器】功能",
        "工具箱模块增加【笔记本电池健康曲线】功能",
        "工具箱模块增加【中国房贷计算器】功能",
        "工具箱模块增加【BMI计算器】功能",
    ],
    "v1.1.10": [
        "修复热搜模块切换分类出现的热搜未改变问题",
    ],
    "v1.1.11": [
        "优化截图翻译时的面板显示状态",
        "优化阅读模块解析文本的能力",
        "待办事项删除时增加弹窗确认",
        "修复阅读模块无法保存上次读取的问题",
        "修复待办事项删除分类导致的闪退问题",
        "修复【中国房贷计算器】部分输入框未适配主题的问题",
    ],
    "v1.2.0": [
        "增加本地文件搜索功能",
        "优化用户沉浸式体验（部分弹窗并入面板）",
        "顶部增加钉住按钮",
        "顶部增加截图按钮",
        "原先的截图翻译集成到截图功能中（截图后可选识别翻译）",
        "快捷键增加本地搜索，调整默认快捷键",
        "增加工具：视频进度条工具、Json格式化工具、时间工具",
        "修复智能体固定场景导致的不友好体验",
        "增加KFC随机文案和KFC随机梗图",
        "增加bilibili粉丝数卡片",
        "搜索卡片三个搜索引擎改为多个并单选，可保存选择状态",
    ],
    "v1.2.1": [
        "增加喜加一资讯卡片",
        "切换到本地搜索界面后焦点移到搜索框",
        "修复截屏后悬浮按钮未消失的问题",
        "修复开机自启动可能失效的问题",
        "修复主题设置透明度回显问题",
        "修复待办事项部分问题",
    ],
    "v1.2.2": [
        "优化卡片设计界面",
        "修复双屏状态下的截屏问题",
        "增加自定义快捷方式卡片",
        "部分工具和游戏合并到浏览器功能中",
        "VIP用户隐藏智能对话和翻译的使用次数展示",
    ],
    "v1.2.3": [
        "修复相同卡片修改数据问题",
    ],
    "v1.2.4": [
        "邀请用户奖励从7天周卡升级为30天月卡",
        "截屏功能美化样式",
        "截屏功能修复单屏高分辨率问题",
        "截屏功能增加矩形、椭圆、直线、箭头等绘制功能",
        "修复软件登录界面安装新版本可能失败的问题",
        "修复卡片商店不同尺寸安装状态不一致的问题",
        "修复开机自启动在部分电脑可能失效的问题",
    ],
    "v1.3.0": [
        "优化软件升级逻辑，新增热补丁升级方式",
        "优化图片加载模块，优化安装包安装速度",
        "面板顶部部分按钮合并到更多菜单按钮中",
        "检查更新功能增加新版本内容提示",
        "修复待办事项的时间选择样式适配问题",
        "修复部分情况下无法完全退出的问题",
        "修复重新登录后的界面样式问题",
    ],
    "v1.3.1": [
        "增加股票卡片",
        "增加屏幕取色、颜色转换功能",
        "优化喝水记录卡片的喝水记录曲线展示",
        "优化笔记本电池健康曲线的曲线展示",
        "调整热搜模块数据加载频率",
        "修复云端升级过程中出现的退出问题",
    ],
    "v1.3.2": [
        "增加基金卡片",
        "调整热搜模块样式",
        "卡片设计器优化加载速度",
        "卡片商店顶部增加搜索功能",
        "卡片商店同步卡片安装状态",
        "翻译功能修复切换按钮悬浮的提示",
        "翻译功能取消回车发送",
    ],
    # "v1.3.3": [
    #     "增加截图识别表格功能",
    #     "增加图片转表格(Excel)功能",
    #     "定期更新登录信息(需要删除)",
    # ],
    # "v1.4.0": [
    #     "翻译功能增加自动识别+保存上次识别语言",
    #     "AI对话模块优化",
    #     "增加文件批量修改功能",
    #     "增加编解码工具功能",
    #     "基金股票等卡片完善",
    #     "增加截图识别文档功能",
    #     "增加图片转文档(Word)功能",
    #     "增加PDF转表格(Excel)/文档(Word)功能",
    #     "增加自定义菜单模块功能",
    #     "调整面板卡片数据刷新频率",
    # ],
}

update_map_date = {
    "v1.0.0": "2025-08-05",
    "v1.1.0": "2025-08-13",
    "v1.1.1": "2025-08-14",
    "v1.1.2": "2025-08-14",
    "v1.1.3": "2025-08-14",
    "v1.1.4": "2025-08-15",
    "v1.1.5": "2025-08-16",
    "v1.1.6": "2025-08-17",
    "v1.1.7": "2025-08-17",
    "v1.1.8": "2025-08-18",
    "v1.1.9": "2025-08-18",
    "v1.1.10": "2025-08-19",
    "v1.1.11": "2025-08-21",
    "v1.2.0": "2025-08-25",
    "v1.2.1": "2025-08-26",
    "v1.2.2": "2025-08-28",
    "v1.2.3": "2025-08-29",
    "v1.2.4": "2025-08-30",
    "v1.3.0": "2025-09-01",
    "v1.3.1": "2025-09-02",
    "v1.3.2": "2025-09-03",
}


def get_update_info():
    update_info = ""
    # 提取所有版本号并排序（从新到旧）
    sorted_versions = sorted(
        update_map_info.keys(),
        key=lambda v: tuple(map(int, v[1:].split('.'))),  # 将 "v0.3.2" 转换为 (0,3,2)
        reverse=True  # 降序排列（最新在前）
    )

    for version in sorted_versions:
        update_info += "#### 版本 " + version + " - " + update_map_date[version] + "\n"
        for item in update_map_info[version]:
            if item:  # 跳过空字符串
                update_info += "* " + item + "\n"
        update_info += "\n"
    return update_info


def get_current_version():
    return list(update_map_info.keys())[-1]


def gen_download_history_md():
    # 提取所有版本号并排序（从新到旧）
    sorted_versions = sorted(
        update_map_info.keys(),
        key=lambda v: tuple(map(int, v[1:].split('.'))),  # 将 "v0.3.2" 转换为 (0,3,2)
        reverse=True  # 降序排列（最新在前）
    )
    update_info = ""
    for version in sorted_versions:
        update_info += "#### 版本 " + version + " - " + update_map_date[version] + "\n"
        for item in update_map_info[version]:
            if item:  # 跳过空字符串
                update_info += "- " + item + "\n"
        update_info += "\n"
    return update_info

def compare_version(version_1, version_2):
    # 版本1的主、次、补丁版本
    version_1_major = version_1.replace("v", "").split(".")[0]
    version_1_minor = version_1.replace("v", "").split(".")[1]
    version_1_patch = version_1.replace("v", "").split(".")[2]
    # 版本2的主、次、补丁版本
    version_2_major = version_2.replace("v", "").split(".")[0]
    version_2_minor = version_2.replace("v", "").split(".")[1]
    version_2_patch = version_2.replace("v", "").split(".")[2]
    # 比较版本号
    if version_1_major == version_2_major:
        if version_1_minor == version_2_minor:
            if version_1_patch == version_2_patch:
                return 0
            elif int(version_1_patch) > int(version_2_patch):
                return 1
            else:
                return -1
        elif int(version_1_minor) > int(version_2_minor):
            return 1
        else:
            return -1
    elif int(version_1_major) > int(version_2_major):
        return 1
    else:
        return -1

print(gen_download_history_md())
